natural_convection/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          21012;
        startFace       438271;
    }
    cylinderSurface
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1356;
        startFace       459283;
    }
)

// ************************************************************************* //
